solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_STATUS_BUSY_MASK          (0x400000U)
#define OCOTP_HW_OCOTP_STATUS_BUSY_SHIFT         (22U)
#define OCOTP_HW_OCOTP_STATUS_BUSY(x)            (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_STATUS_BUSY_SHIFT)) & OCOTP_HW_OCOTP_STATUS_BUSY_MASK)

#define OCOTP_HW_OCOTP_STATUS_FUSE_LATCHED_MASK  (0x2000000U)
#define OCOTP_HW_OCOTP_STATUS_FUSE_LATCHED_SHIFT (25U)
#define OCOTP_HW_OCOTP_STATUS_FUSE_LATCHED(x)    (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_STATUS_FUSE_LATCHED_SHIFT)) & OCOTP_HW_OCOTP_STATUS_FUSE_LATCHED_MASK)

#define OCOTP_HW_OCOTP_STATUS_CALIBRATED_MASK    (0x4000000U)
#define OCOTP_HW_OCOTP_STATUS_CALIBRATED_SHIFT   (26U)
#define OCOTP_HW_OCOTP_STATUS_CALIBRATED(x)      (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_STATUS_CALIBRATED_SHIFT)) & OCOTP_HW_OCOTP_STATUS_CALIBRATED_MASK)
/*! @} */

/*! @name VERSION - OTP Controller Version Register */
/*! @{ */

#define OCOTP_VERSION_STEP_VER_MASK              (0xFFFFU)
#define OCOTP_VERSION_STEP_VER_SHIFT             (0U)
#define OCOTP_VERSION_STEP_VER(x)                (((uint32_t)(((uint32_t)(x)) << OCOTP_VERSION_STEP_VER_SHIFT)) & OCOTP_VERSION_STEP_VER_MASK)

#define OCOTP_VERSION_MINOR_VER_MASK             (0xFF0000U)
#define OCOTP_VERSION_MINOR_VER_SHIFT            (16U)
#define OCOTP_VERSION_MINOR_VER(x)               (((uint32_t)(((uint32_t)(x)) << OCOTP_VERSION_MINOR_VER_SHIFT)) & OCOTP_VERSION_MINOR_VER_MASK)

#define OCOTP_VERSION_MAJOR_VER_MASK             (0xFF000000U)
#define OCOTP_VERSION_MAJOR_VER_SHIFT            (24U)
#define OCOTP_VERSION_MAJOR_VER(x)               (((uint32_t)(((uint32_t)(x)) << OCOTP_VERSION_MAJOR_VER_SHIFT)) & OCOTP_VERSION_MAJOR_VER_MASK)
/*! @} */

/*! @name HW_OCOTP_NONMASK_STATUS1 - OTP Controller Nonmask Status1 Register */
/*! @{ */

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_PBRICK_ERR_MASK (0x20U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_PBRICK_ERR_SHIFT (5U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_PBRICK_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_PBRICK_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_PBRICK_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_OTP_STATE_ERR_MASK (0x40U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_OTP_STATE_ERR_SHIFT (6U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_OTP_STATE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_OTP_STATE_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_OTP_STATE_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_DED_RELOAD_MASK (0x80U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_DED_RELOAD_SHIFT (7U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_DED_RELOAD(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_DED_RELOAD_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_DED_RELOAD_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_DED_MASK (0x100U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_DED_SHIFT (8U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_DED(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_DED_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_DED_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SEC_RELOAD_MASK (0x200U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SEC_RELOAD_SHIFT (9U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SEC_RELOAD(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SEC_RELOAD_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SEC_RELOAD_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SEC_MASK (0x400U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SEC_SHIFT (10U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SEC(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SEC_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SEC_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_DONE_MASK (0x800U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_DONE_SHIFT (11U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_DONE(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_DONE_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_DONE_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_LUT_SEL_ERR_MASK (0x1000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_LUT_SEL_ERR_SHIFT (12U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_LUT_SEL_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_LUT_SEL_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_LUT_SEL_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_ADDRESS_RANGE_ERR_MASK (0x2000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_ADDRESS_RANGE_ERR_SHIFT (13U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_ADDRESS_RANGE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_ADDRESS_RANGE_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_ADDRESS_RANGE_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_WRITE_PROTECT_ERR_MASK (0x4000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_WRITE_PROTECT_ERR_SHIFT (14U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_WRITE_PROTECT_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_WRITE_PROTECT_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_WRITE_PROTECT_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_SECURTY_PROTECT_ERR_MASK (0x8000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_SECURTY_PROTECT_ERR_SHIFT (15U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_SECURTY_PROTECT_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_SECURTY_PROTECT_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_CRC_SECURTY_PROTECT_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_WRITE_ERR_MASK (0x10000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_WRITE_ERR_SHIFT (16U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_WRITE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_WRITE_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_WRITE_ERR_MASK)

