solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_LOAD_ERR_MASK (0x20000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_LOAD_ERR_SHIFT (17U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_LOAD_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_LOAD_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_LOAD_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_COUNTER_ERR_MASK (0x40000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_COUNTER_ERR_SHIFT (18U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_COUNTER_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_COUNTER_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_COUNTER_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_BITPROTECT_ERR_MASK (0x80000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_BITPROTECT_ERR_SHIFT (19U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_BITPROTECT_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_BITPROTECT_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_BITPROTECT_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_PRNG_O_FAULT_MASK (0x100000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_PRNG_O_FAULT_SHIFT (20U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_PRNG_O_FAULT(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_PRNG_O_FAULT_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_PRNG_O_FAULT_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_ECC_ZEROIZED_ERR_MASK (0x200000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_ECC_ZEROIZED_ERR_SHIFT (21U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_ECC_ZEROIZED_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_ECC_ZEROIZED_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_ECC_ZEROIZED_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_ACCESS_ERR_MASK (0x400000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_ACCESS_ERR_SHIFT (22U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_ACCESS_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_ACCESS_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_ACCESS_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_RELOAD_REQ_ERR_MASK (0x800000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_RELOAD_REQ_ERR_SHIFT (23U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_RELOAD_REQ_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_RELOAD_REQ_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_RELOAD_REQ_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_WRITE_DURING_RELOAD_ERR_MASK (0x1000000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_WRITE_DURING_RELOAD_ERR_SHIFT (24U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_WRITE_DURING_RELOAD_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_WRITE_DURING_RELOAD_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_WRITE_DURING_RELOAD_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_HVF_READ_ERR_MASK (0x2000000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_HVF_READ_ERR_SHIFT (25U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_HVF_READ_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_HVF_READ_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_HVF_READ_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_HVF_WRITE_ERR_MASK (0x4000000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_HVF_WRITE_ERR_SHIFT (26U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_HVF_WRITE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_HVF_WRITE_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_HVF_WRITE_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_SRAM_READ_ERR_MASK (0x8000000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_SRAM_READ_ERR_SHIFT (27U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_SRAM_READ_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_SRAM_READ_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_SRAM_READ_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_SRAM_WRITE_ERR_MASK (0x10000000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_SRAM_WRITE_ERR_SHIFT (28U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_SRAM_WRITE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_SRAM_WRITE_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_SRAM_WRITE_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_READ_ERR_MASK (0x20000000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_READ_ERR_SHIFT (29U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_READ_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_READ_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_READ_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_PROG_ERR_MASK (0x40000000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_PROG_ERR_SHIFT (30U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_PROG_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_PROG_ERR_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_FUSE_PROG_ERR_MASK)

#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_NO_ACCESS_MASK (0x80000000U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_NO_ACCESS_SHIFT (31U)
#define OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_NO_ACCESS(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_NO_ACCESS_SHIFT)) & OCOTP_HW_OCOTP_NONMASK_STATUS1_NONMASK_SHADOW_NO_ACCESS_MASK)
/*! @} */

/*! @name HW_OCOTP_MASK_CTRL1 - OTP Controller Mask Ctrl1 Register */
/*! @{ */

#define OCOTP_HW_OCOTP_MASK_CTRL1_TIMEOUT_COUNTER_MASK (0x7U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_TIMEOUT_COUNTER_SHIFT (0U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_TIMEOUT_COUNTER(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_TIMEOUT_COUNTER_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_TIMEOUT_COUNTER_MASK)

