solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_WRITE_DURING_RELOAD_ERR_MASK (0x1000000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_WRITE_DURING_RELOAD_ERR_SHIFT (24U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_WRITE_DURING_RELOAD_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_WRITE_DURING_RELOAD_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_WRITE_DURING_RELOAD_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_HVF_READ_ERR_MASK (0x2000000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_HVF_READ_ERR_SHIFT (25U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_HVF_READ_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_HVF_READ_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_HVF_READ_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_HVF_WRITE_ERR_MASK (0x4000000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_HVF_WRITE_ERR_SHIFT (26U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_HVF_WRITE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_HVF_WRITE_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_HVF_WRITE_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_SRAM_READ_ERR_MASK (0x8000000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_SRAM_READ_ERR_SHIFT (27U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_SRAM_READ_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_SRAM_READ_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_SRAM_READ_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_SRAM_WRITE_ERR_MASK (0x10000000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_SRAM_WRITE_ERR_SHIFT (28U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_SRAM_WRITE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_SRAM_WRITE_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_SRAM_WRITE_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_READ_ERR_MASK (0x20000000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_READ_ERR_SHIFT (29U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_READ_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_READ_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_READ_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_PROG_ERR_MASK (0x40000000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_PROG_ERR_SHIFT (30U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_PROG_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_PROG_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_FUSE_PROG_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_NO_ACCESS_MASK (0x80000000U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_NO_ACCESS_SHIFT (31U)
#define OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_NO_ACCESS(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_NO_ACCESS_SHIFT)) & OCOTP_HW_OCOTP_MASK_CTRL1_CTRL_MASK_SHADOW_NO_ACCESS_MASK)
/*! @} */

/*! @name HW_OCOTP_MASK_STATUS1 - OTP Controller Nonmask Status1 Register */
/*! @{ */

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_PBRICK_ERR_MASK (0x20U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_PBRICK_ERR_SHIFT (5U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_PBRICK_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_PBRICK_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_PBRICK_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_OTP_STATE_ERR_MASK (0x40U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_OTP_STATE_ERR_SHIFT (6U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_OTP_STATE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_OTP_STATE_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_OTP_STATE_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_DED_RELOAD_MASK (0x80U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_DED_RELOAD_SHIFT (7U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_DED_RELOAD(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_DED_RELOAD_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_DED_RELOAD_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_DED_MASK (0x100U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_DED_SHIFT (8U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_DED(x)  (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_DED_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_DED_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_SEC_RELOAD_MASK (0x200U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_SEC_RELOAD_SHIFT (9U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_SEC_RELOAD(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_SEC_RELOAD_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_SEC_RELOAD_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SEC_MASK (0x400U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SEC_SHIFT (10U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SEC(x)  (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SEC_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_SEC_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_DONE_MASK (0x800U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_DONE_SHIFT (11U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_DONE(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_DONE_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_DONE_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_LUT_SEL_ERR_MASK (0x1000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_LUT_SEL_ERR_SHIFT (12U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_LUT_SEL_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_LUT_SEL_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_LUT_SEL_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_ADDRESS_RANGE_ERR_MASK (0x2000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_ADDRESS_RANGE_ERR_SHIFT (13U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_ADDRESS_RANGE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_ADDRESS_RANGE_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_ADDRESS_RANGE_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_WRITE_PROTECT_ERR_MASK (0x4000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_WRITE_PROTECT_ERR_SHIFT (14U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_WRITE_PROTECT_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_WRITE_PROTECT_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_WRITE_PROTECT_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_SECURTY_PROTECT_ERR_MASK (0x8000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_SECURTY_PROTECT_ERR_SHIFT (15U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_SECURTY_PROTECT_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_SECURTY_PROTECT_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_CRC_SECURTY_PROTECT_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_WRITE_ERR_MASK (0x10000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_WRITE_ERR_SHIFT (16U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_WRITE_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_WRITE_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_WRITE_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_LOAD_ERR_MASK (0x20000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_LOAD_ERR_SHIFT (17U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_LOAD_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_LOAD_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_LOAD_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_COUNTER_ERR_MASK (0x40000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_COUNTER_ERR_SHIFT (18U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_COUNTER_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_COUNTER_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_COUNTER_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_BITPROTECT_ERR_MASK (0x80000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_BITPROTECT_ERR_SHIFT (19U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_BITPROTECT_ERR(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_BITPROTECT_ERR_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_BITPROTECT_ERR_MASK)

#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_PRNG_O_FAULT_MASK (0x100000U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_PRNG_O_FAULT_SHIFT (20U)
#define OCOTP_HW_OCOTP_MASK_STATUS1_MASK_PRNG_O_FAULT(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_MASK_STATUS1_MASK_PRNG_O_FAULT_SHIFT)) & OCOTP_HW_OCOTP_MASK_STATUS1_MASK_PRNG_O_FAULT_MASK)

