solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT15_MASK (0x8000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT15_SHIFT (15U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT15(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT15_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT15_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT16_MASK (0x10000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT16_SHIFT (16U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT16(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT16_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT16_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT17_MASK (0x20000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT17_SHIFT (17U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT17(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT17_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT17_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT18_MASK (0x40000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT18_SHIFT (18U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT18(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT18_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT18_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT19_MASK (0x80000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT19_SHIFT (19U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT19(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT19_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT19_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT20_MASK (0x100000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT20_SHIFT (20U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT20(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT20_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT20_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT21_MASK (0x200000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT21_SHIFT (21U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT21(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT21_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT21_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT22_MASK (0x400000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT22_SHIFT (22U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT22(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT22_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT22_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT23_MASK (0x800000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT23_SHIFT (23U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT23(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT23_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT23_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT24_MASK (0x1000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT24_SHIFT (24U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT24(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT24_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT24_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT25_MASK (0x2000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT25_SHIFT (25U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT25(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT25_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT25_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT26_MASK (0x4000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT26_SHIFT (26U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT26(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT26_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT26_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT27_MASK (0x8000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT27_SHIFT (27U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT27(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT27_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT27_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT28_MASK (0x10000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT28_SHIFT (28U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT28(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT28_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT28_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT29_MASK (0x20000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT29_SHIFT (29U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT29(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT29_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT29_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT30_MASK (0x40000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT30_SHIFT (30U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT30(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT30_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT30_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT31_MASK (0x80000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT31_SHIFT (31U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT31(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT31_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_0_LOCK_STICKY_BIT31_MASK)
/*! @} */

/*! @name HW_OCOTP_LOCK_STICKY_1 - OTP Controller Lock Sticky Register1 */
/*! @{ */

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT32_MASK (0x1U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT32_SHIFT (0U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT32(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT32_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT32_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT33_MASK (0x2U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT33_SHIFT (1U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT33(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT33_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT33_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT34_MASK (0x4U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT34_SHIFT (2U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT34(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT34_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT34_MASK)

