solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT61_MASK (0x20000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT61_SHIFT (29U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT61(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT61_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT61_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT62_MASK (0x40000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT62_SHIFT (30U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT62(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT62_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT62_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT63_MASK (0x80000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT63_SHIFT (31U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT63(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT63_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_1_LOCK_STICKY_BIT63_MASK)
/*! @} */

/*! @name HW_OCOTP_LOCK_STICKY_2 - OTP Controller Lock Sticky Register2 */
/*! @{ */

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT64_MASK (0x1U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT64_SHIFT (0U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT64(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT64_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT64_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT65_MASK (0x2U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT65_SHIFT (1U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT65(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT65_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT65_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT66_MASK (0x4U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT66_SHIFT (2U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT66(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT66_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT66_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT67_MASK (0x8U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT67_SHIFT (3U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT67(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT67_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT67_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT68_MASK (0x10U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT68_SHIFT (4U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT68(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT68_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT68_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT69_MASK (0x20U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT69_SHIFT (5U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT69(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT69_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT69_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT70_MASK (0x40U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT70_SHIFT (6U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT70(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT70_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT70_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT71_MASK (0x80U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT71_SHIFT (7U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT71(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT71_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT71_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT72_MASK (0x100U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT72_SHIFT (8U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT72(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT72_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT72_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT73_MASK (0x200U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT73_SHIFT (9U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT73(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT73_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT73_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT74_MASK (0x400U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT74_SHIFT (10U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT74(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT74_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT74_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT75_MASK (0x800U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT75_SHIFT (11U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT75(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT75_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT75_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT76_MASK (0x1000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT76_SHIFT (12U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT76(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT76_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT76_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT77_MASK (0x2000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT77_SHIFT (13U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT77(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT77_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT77_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT78_MASK (0x4000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT78_SHIFT (14U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT78(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT78_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_2_LOCK_STICKY_BIT78_MASK)

