solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_OCOTP.h
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT119_MASK (0x800000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT119_SHIFT (23U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT119(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT119_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT119_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT120_MASK (0x1000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT120_SHIFT (24U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT120(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT120_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT120_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT121_MASK (0x2000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT121_SHIFT (25U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT121(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT121_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT121_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT122_MASK (0x4000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT122_SHIFT (26U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT122(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT122_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT122_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT123_MASK (0x8000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT123_SHIFT (27U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT123(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT123_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT123_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT124_MASK (0x10000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT124_SHIFT (28U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT124(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT124_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT124_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT125_MASK (0x20000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT125_SHIFT (29U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT125(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT125_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT125_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT126_MASK (0x40000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT126_SHIFT (30U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT126(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT126_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT126_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT127_MASK (0x80000000U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT127_SHIFT (31U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT127(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT127_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_3_LOCK_STICKY_BIT127_MASK)
/*! @} */

/*! @name HW_OCOTP_LOCK_STICKY_4 - OTP Controller Lock Sticky Register4 */
/*! @{ */

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT128_MASK (0x1U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT128_SHIFT (0U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT128(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT128_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT128_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT129_MASK (0x2U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT129_SHIFT (1U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT129(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT129_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT129_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT130_MASK (0x4U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT130_SHIFT (2U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT130(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT130_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT130_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT131_MASK (0x8U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT131_SHIFT (3U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT131(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT131_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT131_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT132_MASK (0x10U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT132_SHIFT (4U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT132(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT132_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT132_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT133_MASK (0x20U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT133_SHIFT (5U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT133(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT133_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT133_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT134_MASK (0x40U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT134_SHIFT (6U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT134(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT134_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT134_MASK)

#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT135_MASK (0x80U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT135_SHIFT (7U)
#define OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT135(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT135_SHIFT)) & OCOTP_HW_OCOTP_LOCK_STICKY_4_LOCK_STICKY_BIT135_MASK)

